doc/spec/spec.org
* 引言

** 背景

** 产品愿景

** 参考文档

** 外部依赖

*** 第三方支付

*** 短信解决方案

    短信验证功能所需的服务器发短信的功能有多种实现方式，各有利弊：

    1. 服务器连接一台安卓手机，使用ADB发短信
    2. 服务器连接一个GSM模块，使用该模块提供的接口发短信
    3. 购买电信服务商的短信网关服务

* 功能性需求

** 用户模块

*** 注册

    + 注册过程分为两步：
      1. 填写基本资料
      2. 邮箱验证
    + 注册时需要填写的基本资料包括：
      1. 用户名（登录名）：唯一
      2. 真实姓名
      3. 身份证号码：唯一
      4. 省份和城市
      5. 电子邮箱：唯一
      6. 登录密码
      7. 默认注册用户为普通用户
    + 注册提交需要输入正确的验证码
    + 客户端验证：
      1. 所有字段都做基本的简单格式检查
      2. 用户名、身份证号码、电子邮箱都应是唯一存在：AJAX异步从服务器端验证
      3. 登录密码需要重复输入验证
      4. 验证码也需要用AJAX异步验证
    + 提交注册基本资料之后，系统将会给注册时提供的电子邮箱发邮件，邮件内容包括：
      1. 标题大意：欢迎及完成注册邮件
      2. 内容大意：欢迎及邮箱验证地址链接。
    + 用户点击邮箱验证链接之后完成注册

*** 登录

    + 登录需要输入用户名、登录密码及验证码
    + 用户名和验证码需要作客户端验证
      - 纯客户端验证
      - AJAX异步验证
    + 出于安全考虑，不能保存登录状态：即使说，用户重开浏览器之后就必须重新登录。
    + 提供“找回密码”流程的入口链接

*** 主页

    + 账户余额
      - 显示当前账户余额。
      - 并提供充值、提现、转账按钮或者链接跳转到支付或者交易模块。
    + 账户安全状态
      - 简单明了的告知用户每个安全任务是否都已完成。
      - 并提供链接以便用户跳转到安全模块来完成或者修改安全任务。
    + 最近交易记录
      - 最近的10-15个用户交易或者支付记录
      - 提供链接以便用户查看所有交易记录
      - 核心功能由交易模块提供，用户模块只负责调用及显示。

*** 安全

    + 登录密码
      1. 如果用户的登录密码是简单密码，应该在用户登录后的醒目位置提醒用户使用强密码。
      2. 注意：不能明文记录用户密码，所以用户是否使用强密码需要用单独字段来记录。
      3. 用户每修改一次密码，都需要检查是否是强密码。
      4. 修改登录密码需要提供正确的旧密码。
    + 邮箱
      1. 注册时填写并且验证后的邮箱不能随意改动：如果实在需要改动，需要联系系统管理员来修改。
      2. 为了安全考虑，任何地方都不会显示该邮箱的完整地址，应该将部分字符打码后显示。如：
	 - 假如邮箱地址是：wliu272@163.com
	 - 那就应该显示成类似：w*****2@163.com的形式。
    + 手机
      1. 如果用户没有绑定手机，应该在用户登录后的醒目位置提醒用户手机未绑定
      2. 绑定手机用于需要更高安全性操作的短信验证
      3. 短信验证成功后绑定手机
      4. 需要考虑到短信发送成功率的因素，用户可以强制重发短信
      5. 每条短信应该设置失效时间，通常为1分钟。
    + 支付密码
      1. 必须为强密码
      2. 不能和登录密码相同
      3. 修改支付密码需要邮箱或者短信验证

** 产品模块

*** 权限控制

    + 只有系统管理员或者产品管理员才能新建或者修改产品
    + 所有人都能查看产品内容

*** 新建 & 修改

    每个新产品需要准确输入如下数据：

    + 合同编号
    + 贷款人：选择
    + 贷款用途
    + 贷款金额
    + 最低投资额
    + 投资者年化收益率
    + 平台年化收益率
    + 购买开始日期
    + 购买结束日期
    + 贷款期限：选择
    + 兑付方式：选择
    + 担保公司：选择
    + 担保函编号
    + 担保函扫描件：文件上传及预览

*** 查看

    + 除了平台年化收益率，产品录入时的字段能被所有用户查看
    + 为普通用户提供链接跳转到平台交易投资模块
    + 平台年化收益率只能被系统管理员或者产品管理员查看
    + 产品到期还款进度
      - 只有管理员才能查看
      - 提供链接或者按钮给管理员跳转到平台交易模块录入还款信息：还款金额，日期，流水号等重要银行字据信息。
    + 产品还款完成后的给投资者的兑付进度
      - 只有管理员才能查看
      - 提供链接或者按钮给管理员跳转到平台交易模块兑付给投资者

** 平台交易模块

   所有交易将生成并记录流水号以便以后查对。

*** 用户投资

    + 确认投资的产品信息
    + 输入投资金额：金额必须大于等于对应产品的最小投资额。
    + 如果目标投资金额小于用户账户余额，引入支付模块功能共同完成投资。

*** 到期兑付孙媳

*** 平台内转账


** 在线支付模块

*** 充值

*** 提现

** 字典模块

*** 用户角色

    + 普通用户
    + 系统管理员
    + 产品管理员

*** 地区字典
    
    + 省份
    + 城市
    + 区

*** 贷款人

    + 贷款人姓名或公司名称

*** 担保公司

    + 担保公司名称

*** 产品状态

    + 筹款中
    + 筹款结束
    + 到期还款中
    + 到期兑付中
    + 结束

*** 到期兑付方式

    + 

** 统计模块

** 帮助模块

** 公告模块



* 非功能性需求

** 平台

** 安全

   + 为了简便的保证用户所有敏感信息的安全，全应用都应使用SSL用以加密所有通信。这样会造成性能上的损失，但是基于现有的分析，应该不会大幅降低用户体验，所以暂时不对此进行优化。

** 性能

** 兼容性
